# -*- coding:utf-8 -*-
import os
import sys

base_path = os.path.dirname(os.path.dirname(__file__))
sys.path.insert(0, base_path)

# DATA_PATH获取数据的保存路径
DATA_PATH = os.path.join(base_path, 'data')
# 日志文件路径
LOG_PATH = os.path.join(base_path, 'log')

MYSQL_HOST = '127.0.0.1'
MYSQL_PORT = 3306
MYSQL_USER = 'root'
MYSQL_PWD = 'DRsXT5ZJ6Oi55LPQ'
MYSQL_DB = 'test'
MYSQL_CHARSET = 'utf8mb4'
DEBUG_MODEL = True

#科目级别
Subject_Level = 5
#章节级别
Chapter_Level = 6
#知识点级别
#Keypoint_Level = 7
KeyPoint_Level = 6

Course_Wuli_Map = {
    '7.0': '初一物理',
    '8.0': '初二物理',
    '9.0': '初三物理'
}
Course_HuaXue_Map = {
    '7.0': '初一化学',
    '8.0': '初二化学',
    '9.0': '初三化学'
}
Hua_Id_Map = {
    '九上': 90,
    '九下': 81,
    '高一上': 95,
    '高一下': 85,
    '高二上': 101,
    '高二下': 21,
    '高三上': 107,
    '高三下': 22
}
Wuli_Id_Map = {
    '八年级上': 86,
    '八年级下': 80,
    '九年级': 91,
    '高一上': 97,
    '高一下': 96,
    '高二上': 103,
    '高二下': 102,
    '高三上': 109,
    '高三下': 24
}
Math_Id_Map = {
    '高三上': 106,
    '高三下': 116,
    '高二上': 100,
    '高二下': 115,
    '高一上': 94,
    '高一下': 114,
    '一年级上': 12,
    '一年级下': 13,
    '二年级上': 32,
    '二年级下': 33,
    '三年级上': 40,
    '三年级下': 55,
    '四年级上': 46,
    '四年级下': 56,
    '五年级上': 47,
    '五年级下': 57,
    '六年级上': 48,
    '六年级下': 58,
    '七年级上': 79,
    '七年级下': 110,
    '八年级上': 84,
    '八年级下': 111,
    '九年级上': 89,
    '九年级下': 112
}
Course_Math_Map = {
    '1.0': '一年级数学',
    '2.0': '二年级数学',
    '3.0': '三年级数学',
    '4.0': '四年级数学',
    '5.0': '五年级数学',
    '6.0': '六年级数学',
    '7.0': '初一数学',
    '8.0': '初二数学',
    '9.0': '初三数学'
}
GradeMap = {
    '1': '一年级',
    '2': '二年级',
    '3': '三年级',
    '4': '四年级',
    '5': '五年级',
    '6': '六年级',
    '7': '初一',
    '8': '初二',
    '9': '初三',
    '10': '高一',
    '11': '高二',
    '12': '高三'
}

SortMap = {
    '1': 100,
    '2': 200,
    '3': 300,
    '4': 400,
    '5': 500,
    '6': 600,
    '7': 700,
    '8': 800,
    '9': 900,
    '10': 1000,
    '11': 1100,
    '12': 1200
}
GradeLevelMap = {
    '1': 3,
    '2': 3,
    '3': 3,
    '4': 3,
    '5': 3,
    '6': 3,
    '7': 3,
    '8': 3,
    '9': 3,
    '10': 3,
    '11': 3,
    '12': 3
}

GradeFidMap = {
    '1': 11,
    '2': 12,
    '3': 13,
    '4': 14,
    '5': 15,
    '6': 16,
    '7': 17,
    '8': 6,
    '9': 7,
    '10': 8,
    '11': 9,
    '12': 10
}

Subject_Fid_Map = {
    '1': 6,
    '2': 7,
    '3': 8,
    '4': 9,
    '5': 10,
    '6': 11,
    '7': 71,
    '8': 72,
    '9': 73
}